cf/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновляемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/WebServices/ConnectionParametersWS/Ext/Module.bsl
Функция ПолучитьРезультатЗапроса(BaseIDArray)

	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	МассивБаз = Сериализатор.ПрочитатьXDTO(BaseIDArray);

    Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ
    	|	ИнформационныеБазы.BaseID,
    	|	ИнформационныеБазы.Наименование КАК BaseDescription,
    	|	ИнформационныеБазы.WSСсылка КАК LocationWSDL,
    	|	ИнформационныеБазы.WSПользователь КАК User,
    	|	ИнформационныеБазы.WSПароль КАК Password
    	|ИЗ
    	|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
    	|ГДЕ
    	|	ИнформационныеБазы.BaseID <> """"
    	|	И Условие";
	
	Если МассивБаз.Количество() Тогда
	    Условие = "ИнформационныеБазы.BaseID В(&МассивБаз)";
		Запрос.УстановитьПараметр("МассивБаз", МассивБаз);
	Иначе
	    Условие = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Условие", Условие);
    
    Возврат Запрос.Выполнить();

КонецФункции // ПолучитьРезультатЗапроса()
 

Функция GetXML(BaseIDArray)
	
    РезультатЗапроса = ПолучитьРезультатЗапроса(BaseIDArray);
    
    Выборка = РезультатЗапроса.Выбрать();
    
    ЗаписьXML  = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку();
    ЗаписьXML.ЗаписатьОбъявлениеXML();
 
    ConnectionParametersWS = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ConnectionParametersWS", "ConnectionParametersWS"));
    
    Пока Выборка.Следующий() Цикл
    	
    	SetOfParameters = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.roust.com/ConnectionParametersWS", "SetOfParameters"));
    	SetOfParameters.BaseID = Выборка.BaseID;
    	SetOfParameters.BaseDescription = Выборка.Наименование;
    	SetOfParameters.LocationWSDL = Выборка.WSСсылка;
    	SetOfParameters.User = Выборка.WSПользователь;
    	SetOfParameters.Password = Выборка.WSПароль;
        	
    	ConnectionParametersWS.SetOfParameters.Добавить(SetOfParameters);
    КонецЦикла;
    
	Возврат ConnectionParametersWS;
	
КонецФункции

Функция GetValueTable(BaseIDArray)
	
	РезультатЗапроса = ПолучитьРезультатЗапроса(BaseIDArray);
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(РезультатЗапроса.Выгрузить());
	
КонецФункции
